df16_personal_review.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2016-10-18 火 12:03 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Dreamforce'16 参加者振り返り</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="ntakeda67" />
<link rel="stylesheet" type="text/css" href="./resource/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="./resource/readtheorg/css/readtheorg.css"/>


</head>
<body>
<div id="content">
<h1 class="title">Dreamforce'16 参加者振り返り</h1>
<div id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline3">1. Overview</a>
<ul>
<li><a href="#orgheadline1">1.1. 開催要領</a></li>
<li><a href="#orgheadline2">1.2. Topics</a></li>
</ul>
</li>
<li><a href="#orgheadline10">2. 振り返り前個人メモ</a>
<ul>
<li><a href="#orgheadline4">2.1. 参加前のDreamforceへの期待値</a></li>
<li><a href="#orgheadline5">2.2. 実際にわかったこと</a></li>
<li><a href="#orgheadline9">2.3. わかったことなどでみんなに共有したいこと</a></li>
</ul>
</li>
</ul>
</div>
</div>
<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','https://www.google-analytics.com/analytics.js','ga');

  ga('create', 'UA-85895708-1', 'auto');
  ga('send', 'pageview');

</script>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> 開催要領</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>とき: 2016/10/12(水) 12:00 - 12:30</li>
<li>ところ: 京橋社内 その辺</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> Topics</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>社内共有会の日取り
<ul class="org-ul">
<li>10/20(木) ランチ勉強会
<ul class="org-ul">
<li>さらっとした目玉紹介。例えば興味を引く以下</li>
<li>Einstein: 正士
<ul class="org-ul">
<li>AI民主化の話 (レイヤーが高い) をする</li>
<li>(NLP、日本語怪しい)</li>
</ul></li>
<li>Lightning: 中山</li>
<li>DX: 夏 15min</li>
</ul></li>
<li>10/21(金) 締め会 LT: 正和</li>
</ul></li>
<li>社内共有会の概要</li>
<li>社内共有会の発表者決定</li>
<li>社内共有会の資料作成者の決定</li>
<li>2016/10/27 (19:00〜) に、SalesforceDeveloperMeetupの参加者（発表者）決定
<ul class="org-ul">
<li>コアなところ、Flectの知見が生きるところ
<ul class="org-ul">
<li>Heroku Connect: 啓 10min</li>
<li>Scrum Workshop: 玉 10min</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">2</span> 振り返り前個人メモ</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">2.1</span> 参加前のDreamforceへの期待値</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>参加者の熱量と肌感を知る
<ul class="org-ul">
<li>-&gt; カネとジカンとヒトがデカイスケールで突っ込まれていることは実感できた</li>
<li>-&gt; （セッションや興味範囲の乖離はあれど）スーツ族もギーク族も集まる今時点でデカイコミュニティなのだと</li>
</ul></li>
<li>Salesforceを（自身が）やる気になる
<ul class="org-ul">
<li>世間からの注目の高さは理解した</li>
<li>セッション内で新出情報のつまみ食いができたし、trailheadの整備が進むということで自分で食べ歩くこともできそう</li>
<li>美味しいところしか食べられないので、現実の案件で現実の生臭いところに当たっていくための下準備の道が見えたということで</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">2.2</span> 実際にわかったこと</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>xx Flow的なモダン開発・CIサイクルを多くの人が欲していた
<ul class="org-ul">
<li>Salesforce DXのデモブースはいつも人が群がっていたように思う。</li>
</ul></li>
<li>Lightning推進に本腰
<ul class="org-ul">
<li>メインキーノート Parker Harris談「SFとしてはLightningはreadyなんだ、使える状態になったんだ」</li>
<li>DF期間中、Lightningじゃない画面を見ることはほぼなかった
<ul class="org-ul">
<li>セッション "Migrating Lightning Components from Visualforce" の入場に長蛇の列ができていた</li>
</ul></li>
</ul></li>
<li>AppExchangeの重要性推し
<ul class="org-ul">
<li>開発効率が上がる、改善のサイクルを高められる等々、「使えるから、使ってくれ、パートナも引き続きいいものをどんどん作ってくれ」</li>
<li>各AppについてLightning Ready Certification( <a href="https://partners.salesforce.com/s/education/general/Lightning_Experience">https://partners.salesforce.com/s/education/general/Lightning_Experience</a> ) 取得の推進</li>
</ul></li>
<li>Einstein
<ul class="org-ul">
<li>軽い使用例の紹介ということで、夢は大いに語られた。意気込みは感じる</li>
<li>データの基盤としてのThunderと、利用者接点アプリたるLighgning等の間に横たわる、基盤的存在として喧伝</li>
<li>impliする・売る立場として、何をどこまで売り先にコミットできるかはまだわからない。
<ul class="org-ul">
<li>学習、リコメンドのconfigurableな部分や、その効果測定や結果検証やチューニングポイント、デバッグがどうできるかとか。
<ul class="org-ul">
<li>データの収集とそのクレンジング、分析モデルのチューニングによる継続的な質向上がAIのキモだと思う。思うけど、大枠の夢しか情報がなく。</li>
<li>ビッグデータ時代にもさんざやられていた「ツール売り」みたいな、益体のない商売にならないように出来るか</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">2.3</span> わかったことなどでみんなに共有したいこと</h3>
<div class="outline-text-3" id="text-2-3">
</div><ol class="org-ol"><li><a id="orgheadline6"></a>セッション・キーノートのトピックについて<br  /><div class="outline-text-4" id="text-2-3-1">
<p>
開発者目線にて。
</p>

<ul class="org-ul">
<li>Lightning Experience, Componentの 開発の準備を始めるときが来た</li>
<li>来夏に Salesforce DXが来そうなので その前提で
<ul class="org-ul">
<li>before Salesforce DXでは、既存PJ・既存SF機能枠組み範囲内での、開発フロー整備の温度感</li>
<li>after Salesforce DX で開発/リリースワークフロー 検証の準備を</li>
</ul></li>
<li>Heroku CI
<ul class="org-ul">
<li>脱サードパティサービス（wercker）を目して、Heroku CIへの期待整理と新出情報待ち</li>
<li>Review appsは積極的に、機能自体の習熟、利用フローの整備がこなれていくよう試していけるところ</li>
<li>Heroku Connectは外せない機能 + 急ぎリリースされた機能のためかバグが多く。個々に試す以前に Subaru/Komatsu?の知見回収からかしら</li>
</ul></li>
<li>Einsteinは・・・開発者目線ではまだ新出情報待ち(何がどこまでimpli可能、configurableなのか)？</li>
</ul>
</div></li>

<li><a id="orgheadline8"></a>セッション、キーノートの選び方について<br  /><ol class="org-ol"><li><a id="orgheadline7"></a>新出トピックの情報量は重複する -&gt; 聞くだけならKeynoteで押さえる<br  /><div class="outline-text-5" id="text-2-3-2-1">
<p>
目玉となるトピックの発表は各セッションに遍在するし、複数聞く意味はあまりない。
おそらく、出せる情報が少ない・利用者が限られてるので生々しい話が薄いので無理もない。
Keynoteで頭出ししておけばよい。（Keynote系が初日に固まってればいいんだけど・・・）
</p>

<ul class="org-ul">
<li>Einsteinはプラットフォームのコアとして入るので、それぞれのアプリの立場からの説明が入る。これは当然だし問題ない</li>
<li>Salesforce DX, Heroku CIについては 聞いた範囲で各セッションで情報量の差は少ない
<ul class="org-ul">
<li>Salesforce DX関係
<ul class="org-ul">
<li>Building Force.com Apps from Source</li>
<li>Salesforce for Developers Keynote</li>
<li>Salesforce &amp; Partners, Blazing Trails to Customer Transformation</li>
</ul></li>
<li>Heroku CI関係
<ul class="org-ul">
<li>Introduction to Git-Based Continuous Delivery with Heroku Pipelines</li>
<li>How Salesforce Builds Salesforce using Heroku</li>
<li>Salesforce for Developers Keynote</li>
</ul></li>
</ul></li>
</ul>
</div></li></ol></li></ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: ntakeda67</p>
<p class="date">Created: 2016-10-18 火 12:03</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
